Tekla Open API Reference for Tekla Structures 2025
BaseWeld.MainObject Property
 Gets or sets the main part of the weld.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObject MainObject { get; set; }
Public Property MainObject As ModelObject
	Get
	Set
Property Value
Type: ModelObject
See Also
Reference
BaseWeld Class
Tekla.Structures.Model Namespace